<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"495dc4d91b9d80dee0fcdc7c13990b2e6ac940b13c059596aa544069ce55058e","plan_job_ref":"Job .github/workflows/_test-tf.yaml #7 at https://github.com/DND-IT/github-workflows/actions/runs/14614216628","plan_out_hash":"e6a072c2ea1ef603a8e5adaa3dcdc6e81b3239eecf913e159c2ec5623ed07f14","plan_hash":"932b0b318560fcd54f969ea66b49661bc81dba1536bfa1f0df45498125c5bba5","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #7](https://github.com/DND-IT/github-workflows/actions/runs/14614216628)